MediaTek-Labs/Arduino-Add-On-for-LinkIt-SDK/middleware/third_party/arduino/hardware/arduino/mt7697/boards.txt

menu.cpu=Processor

################################################################################
mt7687_hdk.name=LinkIt MT7687 HDK

mt7687_hdk.vid.0=0x0d28
mt7687_hdk.pid.0=0x0204

mt7687_hdk.upload.tool=flash_tool
mt7687_hdk.upload.protocol=xmodem

mt7687_hdk.build.mcu=cortex-m4
mt7687_hdk.build.f_cpu=192000000L
mt7687_hdk.build.board=mt7687_hdk
mt7687_hdk.build.core=arduino
mt7687_hdk.build.variant=mt7687_hdk
mt7687_hdk.build.ldscript=linkscripts/mt7687_flash.ld

mt7687_hdk.build.lib_bsp=libbsp.a
mt7687_hdk.build.lib_hal=libhal.a
mt7687_hdk.build.lib_lwip=liblwip.a
mt7687_hdk.build.lib_minisupp_wps=libminisupp_wps.a
mt7687_hdk.build.lib_nvdm_CM4_GCC=libnvdm_CM4_GCC.a
mt7687_hdk.build.lib_rtos=librtos.a
mt7687_hdk.build.lib_service=libservice.a

mt7687_hdk.build.chip_mt7687_inc=driver/chip/mt7687/inc/
mt7687_hdk.build.chin_inc=driver/chip/inc/
mt7687_hdk.build.cmsis_mt7687_inc=driver/CMSIS/Device/MTK/mt7687/Include/
mt7687_hdk.build.cmsis_inc=driver/CMSIS/Include/
mt7687_hdk.build.rtos_inc=kernel/rtos/FreeRTOS/Source/include/
mt7687_hdk.build.rtos_cm4_inc=kernel/rtos/FreeRTOS/Source/portable/GCC/ARM_CM4F/
mt7687_hdk.build.lwip_inc=middleware/third_party/lwip/src/include/
mt7687_hdk.build.lwip_ports_inc=middleware/third_party/lwip/ports/include/
mt7687_hdk.build.wifi_inc=driver/board/mt76x7_hdk/wifi/inc/

mt7687_hdk.build.bootloader=mt7687_bootloader.bin
mt7687_hdk.build.wifi_binary=WIFI_RAM_CODE_MT76X7_in_flash.bin
################################################################################
